Repository: PepelyaevDev/crypto_portfolio
Catalog: lib/common/assets/l10n/app_*.arb
Languages: ru

source: Market
ru: Рынок

source: Watchlist
ru: Избранное

source: Portfolio
ru: Портфель

source: News
ru: Новости

source: Settings
ru: Настройки

source: Add coins
ru: Добавить монеты

# watchlistIsEmpty
source: Your watchlist is empty, please add coins
ru: Ваш список избранного пуст, пожалуйста добавьте монеты

# updated
source: Data updated
ru: Данные обновлены

source: Added to watchlist
ru: Добавлено в избранное

source: Removed from watchlist
ru: Удалено из избранного

# marketCap
source: Market сap
ru: Капитализация

# marketCapRank
source: Market сap rank
ru: Рейтинг по капитализации

source: Circulating supply
ru: Доступный объем

source: Total supply
ru: Общий объем

source: Max supply
ru: Максимальный объем

source: Price
ru: Цена

source: Current price
ru: Текущая цена

# percentage24h
source: 24 h. %
ru: 24 ч. %

source: Average net cost
ru: Ср. цена покупки

source: Invested
ru: Вложено

source: Total invested
ru: Всего вложено

source: Delete
ru: Удалить

source: Cancel
ru: Отмена

source: Portfolio statistics
ru: Статистика портфеля

source: Coin chart
ru: График монет

# percentageStablecoins
source: Percentage of stablecoins
ru: Доля стейблкоинов

source: Portfolio data
ru: Данные о портфеле

source: Market data
ru: Рыночные данные

source: Statistics
ru: Статистика

source: Transaction history
ru: История операций

source: Received
ru: Получено

source: Paid
ru: Вложено

source: Delete transaction
ru: Удалить транзакцию

# deletionNotPossible
source: Deletion is not possible
ru: Удаление невозможно

# numberCoinsWillNegative
source: If you delete this transaction, the number of coins will become negative
ru: Если удалить эту транзакцию, количество монет станет отрицательным

# statisticsWillRecalculated
source: The statistics of this coin will be recalculated
ru: Статистика по этой монете будет пересчитана

# actionNotUndone
source: This action will not be undone
ru: Это действие будет невозможно отменить

source: Delete transaction history
ru: Удалить историю операций

# statisticsWillDeleted
source: All statistics will be deleted
ru: Вся статистика будет удалена

source: Holdings
ru: Количество

source: Holdings value
ru: Общая стоимость

source: Profit / loss
ru: Прибыль / убыток

# portfolioCoinIsEmpty
source: The list of transactions for this coin is empty, please add the first transaction
ru: Список операций по этой монете пуст, пожалуйста добавьте первую транзакцию

# portfolioIsEmpty
source: Your portfolio is empty, please add the first transaction
ru: Ваш портфель пуст, пожалуйста добавьте первую транзакцию

source: Add transaction
ru: Добавить транзакцию

source: Coin search
ru: Поиск монеты

source: Buy
ru: Покупка

source: Sell
ru: Продажа

# amountOfMoney
source: Trade amount in USD
ru: Сумма сделки в USD

source: Number of coins
ru: Количество монет

source: Purchased
ru: Куплено

source: Sold
ru: Продано

source: Balance after transaction
ru: Баланс после транзакции

source: Enter balance after transaction
ru: Ввести баланс после транзакции

# transactionAmountPopupHeader
source: To avoid errors due to fees, you can enter the total number of coins in your balance after the transaction
ru: Чтобы избежать ошибок из-за комиссий, вы можете ввести общее количество монет на вашем балансе после транзакции

# transactionAmountPopupBody
source: The application will automatically count the number of coins in the transaction and save it
ru: Приложение автоматически подсчитает количество монет в транзакции и сохранит его

# totalBalanceAfterBuyMustBeGreater
source: The balance after purchase must be greater than the current one
ru: Баланс после покупки должен быть больше текущего

# totalBalanceAfterSellMustBeLess
source: The balance after the sale must be less than the current one
ru: Баланс после продажи должен быть меньше текущего

# balanceLessZero
source: Balance cannot be less than zero
ru: Баланс не может быть меньше нуля

# validatorEmptyField
source: This field cannot be empty
ru: Это поле не может быть пустым

# validatorInvalidNumber
source: Please enter a valid number. Example: 71.1203
ru: Введите корректное число. Пример: 71.1203

source: Date
ru: Дата

source: Time
ru: Время

source: You have
ru: У вас есть

# cannotSell
source: You cannot sell
ru: Вы не можете продать

# mustBeGreater0
source: Value must be greater than 0
ru: Значение должно быть больше 0

# allNews
source: All
ru: Все

source: Source
ru: Источник

source: Author
ru: Автор

source: OK
ru: Понятно

source: Close
ru: Закрыть

source: Personal news
ru: Персональные новости

# personalNewsDesc
source: The 'Watchlist' section contains news about coins from your portfolio and about coins added to watchlist
ru: В разделе 'Избранное' находятся новости о монетах из вашего портфеля и о монетах добавленных в избранное

source: News not found
ru: Новости не найдены

source: View in source
ru: Просмотр в источнике

# clickOnLink
source: Click on the link
ru: Нажмите на ссылку

source: Click on title
ru: Нажмите на заголовок

source: Don't show again
ru: Больше не показывать

# response429
source: Server is not available. Please wait 1 minute and try again
ru: Сервер недоступен. Пожалуйста, подождите 1 минуту и повторите попытку

# freeApp
source: This is a free, non-commercial application.
ru: Это бесплатное некоммерческое приложение.

# clickOnTitleDesc
source: Click on the title in the window that opens to go to the source.
ru: Нажмите на заголовок в открывшемся окне, чтобы перейти к источнику.

# error429desc
source: To obtain data, a third-party API is used with a limit of 20 requests per minute
ru: Для получения данных используется стороннее API с ограничением 20 запросов в минуту

# newsSourceDesc
source: A third-party service is used to receive news
ru: Для получения новостей используется сторонний сервис

# unknownError
source: Something went wrong. Try again later please
ru: Что-то пошло не так. Пожалуйста, попробуйте позже

source: Language settings
ru: Настройки языка

source: App language
ru: Язык приложения

source: News language
ru: Язык новостей

# selectAppLanguageDescription
source: All information in the application except news
ru: Вся информация в приложении кроме новостей

# selectNewsLanguageDescription
source: You will see news from different sources in selected languages
ru: Вы будете видеть новости из разных источников на выбранных языках

source: Additional information
ru: Дополнительная информация

source: Email:
ru: Почта:

# emailAddressCopied
source: Email address copied to clipboard
ru: Адрес электронной почты скопирован в буфер обмена

source: App Information
ru: Информация о приложении

# appDetailInfo1
source: Simple Crypto: A free app designed to track changes in your portfolio on a daily basis
ru: Simple Crypto: бесплатное приложение, разработанное для ежедневного отслеживания изменений в вашем портфеле

# appDetailInfo2
source: For all questions and suggestions, please contact by e-mail
ru: По всем вопросам и предложениям, просьба обращаться по электронной почте

# d1
source: 24H
ru: 24Ч

# d7
source: 7D
ru: 7Д

# d30
source: 1M
ru: 1М

# d90
source: 3M
ru: 3М

# d365
source: 1Y
ru: 1Г

# d1095
source: 3Y
ru: 3Г

# d1825
source: 5Y
ru: 5Л

# dMax
source: MAX
ru: ВСЕ
